In [1]:
library(tidyverse)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.3     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.4     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.0
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

In [2]:
score <- 
    tibble(
    name = c("mike", "carol", "greg", "marcia", "peter", "jan", "bobby", "cindy", "alice"),
    school = c("south", "south", "south", "south", "north", "north", "north", "south", "south"),
    teacher = c("johnson", "johnson", "johnson", "johnson",  "smith", "smith", "smith", "perry", "perry"),
    sex = c("male", "female", "male", "female", "male", "female", "male", "female", "female"),
    math_score = c(4, 3, 2, 4, 3, 4, 5, 4, 5),
    reading_score = c(1, 5, 2, 4, 5, 4, 1, 5, 4)
    )

In [5]:
score

  name   school teacher sex    math_score reading_score
1 mike   south  johnson male   4          1
2 carol  south  johnson female 3          5
3 greg   south  johnson male   2          2
4 marcia south  johnson female 4          4
5 peter  north  smith   male   3          5
6 jan    north  smith   female 4          4
7 bobby  north  smith   male   5          1
8 cindy  south  perry   female 4          5
9 alice  south  perry   female 5          4

In [4]:
print(score)

# A tibble: 9 × 6
  name   school teacher sex    math_score reading_score
  <chr>  <chr>  <chr>   <chr>       <dbl>         <dbl>
1 mike   south  johnson male            4             1
2 carol  south  johnson female          3             5
3 greg   south  johnson male            2             2
4 marcia south  johnson female          4             4
5 peter  north  smith   male            3             5
6 jan    north  smith   female          4             4
7 bobby  north  smith   male            5             1
8 cindy  south  perry   female          4             5
9 alice  south  perry   female          5             4

In [17]:
score %>%
    slice(1:3)

  name  school teacher sex    math_score reading_score
1 mike  south  johnson male   4          1
2 carol south  johnson female 3          5
3 greg  south  johnson male   2          2

In [19]:
score_small <- score %>%
    slice(1:3)
print(score_small)

# A tibble: 3 × 6
  name  school teacher sex    math_score reading_score
  <chr> <chr>  <chr>   <chr>       <dbl>         <dbl>
1 mike  south  johnson male            4             1
2 carol south  johnson female          3             5
3 greg  south  johnson male            2             2

In [20]:
score %>% head(3)

  name  school teacher sex    math_score reading_score
1 mike  south  johnson male   4          1
2 carol south  johnson female 3          5
3 greg  south  johnson male   2          2

In [21]:
score[1:3,]

  name  school teacher sex    math_score reading_score
1 mike  south  johnson male   4          1
2 carol south  johnson female 3          5
3 greg  south  johnson male   2          2

In [24]:
score %>%
    arrange(desc(math_score))

  name   school teacher sex    math_score reading_score
1 bobby  north  smith   male   5          1
2 alice  south  perry   female 5          4
3 mike   south  johnson male   4          1
4 marcia south  johnson female 4          4
5 jan    north  smith   female 4          4
6 cindy  south  perry   female 4          5
7 carol  south  johnson female 3          5
8 peter  north  smith   male   3          5
9 greg   south  johnson male   2          2

In [25]:
score %>%
    arrange(-math_score)

  name   school teacher sex    math_score reading_score
1 bobby  north  smith   male   5          1
2 alice  south  perry   female 5          4
3 mike   south  johnson male   4          1
4 marcia south  johnson female 4          4
5 jan    north  smith   female 4          4
6 cindy  south  perry   female 4          5
7 carol  south  johnson female 3          5
8 peter  north  smith   male   3          5
9 greg   south  johnson male   2          2

In [29]:
score %>%
    arrange(name)

  name   school teacher sex    math_score reading_score
1 alice  south  perry   female 5          4
2 bobby  north  smith   male   5          1
3 carol  south  johnson female 3          5
4 cindy  south  perry   female 4          5
5 greg   south  johnson male   2          2
6 jan    north  smith   female 4          4
7 marcia south  johnson female 4          4
8 mike   south  johnson male   4          1
9 peter  north  smith   male   3          5

In [30]:
score %>%
    arrange(sex)

  name   school teacher sex    math_score reading_score
1 carol  south  johnson female 3          5
2 marcia south  johnson female 4          4
3 jan    north  smith   female 4          4
4 cindy  south  perry   female 4          5
5 alice  south  perry   female 5          4
6 mike   south  johnson male   4          1
7 greg   south  johnson male   2          2
8 peter  north  smith   male   3          5
9 bobby  north  smith   male   5          1

In [31]:
score %>%
    arrange(school, teacher, sex, math_score, reading_score)

  name   school teacher sex    math_score reading_score
1 jan    north  smith   female 4          4
2 peter  north  smith   male   3          5
3 bobby  north  smith   male   5          1
4 carol  south  johnson female 3          5
5 marcia south  johnson female 4          4
6 greg   south  johnson male   2          2
7 mike   south  johnson male   4          1
8 cindy  south  perry   female 4          5
9 alice  south  perry   female 5          4

In [33]:
score %>%
    select(name,math_score,reading_score)

  name   math_score reading_score
1 mike   4          1
2 carol  3          5
3 greg   2          2
4 marcia 4          4
5 peter  3          5
6 jan    4          4
7 bobby  5          1
8 cindy  4          5
9 alice  5          4

In [34]:
score %>%
    select(-sex)

  name   school teacher math_score reading_score
1 mike   south  johnson 4          1
2 carol  south  johnson 3          5
3 greg   south  johnson 2          2
4 marcia south  johnson 4          4
5 peter  north  smith   3          5
6 jan    north  smith   4          4
7 bobby  north  smith   5          1
8 cindy  south  perry   4          5
9 alice  south  perry   5          4

In [35]:
score %>%
    select(-sex, -reading_score)

  name   school teacher math_score
1 mike   south  johnson 4
2 carol  south  johnson 3
3 greg   south  johnson 2
4 marcia south  johnson 4
5 peter  north  smith   3
6 jan    north  smith   4
7 bobby  north  smith   5
8 cindy  south  perry   4
9 alice  south  perry   5

In [39]:
score %>%
    select(sex,everything())

  sex    name   school teacher math_score reading_score
1 male   mike   south  johnson 4          1
2 female carol  south  johnson 3          5
3 male   greg   south  johnson 2          2
4 female marcia south  johnson 4          4
5 male   peter  north  smith   3          5
6 female jan    north  smith   4          4
7 male   bobby  north  smith   5          1
8 female cindy  south  perry   4          5
9 female alice  south  perry   5          4

In [40]:
score %>%
    filter(sex=="male"&school=="south")

  name school teacher sex  math_score reading_score
1 mike south  johnson male 4          1
2 greg south  johnson male 2          2

In [44]:
score %>%
    filter(math_score>mean(math_score))

  name   school teacher sex    math_score reading_score
1 mike   south  johnson male   4          1
2 marcia south  johnson female 4          4
3 jan    north  smith   female 4          4
4 bobby  north  smith   male   5          1
5 cindy  south  perry   female 4          5
6 alice  south  perry   female 5          4

In [45]:
score %>%
    filter(count(math_score>=4&reading_score>=3))

ERROR: Error in `filter()`:
ℹ In argument: `count(math_score >= 4 & reading_score >= 3)`.
Caused by error in `UseMethod()`:
! no applicable method for 'count' applied to an object of class "logical"

In [50]:
score %>% #double pipe
    group_by(teacher) %>%
    filter(max(math_score)==5)

  name  school teacher sex    math_score reading_score
1 peter north  smith   male   3          5
2 jan   north  smith   female 4          4
3 bobby north  smith   male   5          1
4 cindy south  perry   female 4          5
5 alice south  perry   female 5          4

In [51]:
score %>%
    group_by(sex) %>%
    filter(mean(math_score)==4)

  name   school teacher sex    math_score reading_score
1 carol  south  johnson female 3          5
2 marcia south  johnson female 4          4
3 jan    north  smith   female 4          4
4 cindy  south  perry   female 4          5
5 alice  south  perry   female 5          4

In [55]:
score %>%
    mutate(
        math_score=math_score*10, 
        reading_score=reading_score*10
    )

  name   school teacher sex    math_score reading_score
1 mike   south  johnson male   40         10
2 carol  south  johnson female 30         50
3 greg   south  johnson male   20         20
4 marcia south  johnson female 40         40
5 peter  north  smith   male   30         50
6 jan    north  smith   female 40         40
7 bobby  north  smith   male   50         10
8 cindy  south  perry   female 40         50
9 alice  south  perry   female 50         40

In [57]:
score %>%
    mutate(
        math_reading_avg=(math_score+reading_score)/2)

  name   school teacher sex    math_score reading_score math_reading_avg
1 mike   south  johnson male   4          1             2.5
2 carol  south  johnson female 3          5             4.0
3 greg   south  johnson male   2          2             2.0
4 marcia south  johnson female 4          4             4.0
5 peter  north  smith   male   3          5             4.0
6 jan    north  smith   female 4          4             4.0
7 bobby  north  smith   male   5          1             3.0
8 cindy  south  perry   female 4          5             4.5
9 alice  south  perry   female 5          4             4.5